Revit 2022 API
SketchEditScope Class
 A SketchEditScope allows an application to create and maintain an editing session for a Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
public class SketchEditScope : EditScope
Visual Basic
Public Class SketchEditScope _
	Inherits EditScope
Visual C++
public ref class SketchEditScope : public EditScope
Remarks
 Start/end of a SketchEditScope will start/end a transaction group. After a SketchEditScope is started, an application can start transactions and edit the sketch. Individual transactions the application creates inside SketchEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into SketchEditScope constructor.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.EditScope
 Autodesk.Revit.DB.SketchEditScope
See Also
SketchEditScope Members
Autodesk.Revit.DB Namespace